OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f946.h
extern __at(0x0115) volatile __LCDDATA5bits_t LCDDATA5bits;

#define _LCDDATA5_SEG16         0x01
#define _LCDDATA5_SEG16COM1     0x01
#define _LCDDATA5_S16C1         0x01
#define _LCDDATA5_SEG17         0x02
#define _LCDDATA5_SEG17COM1     0x02
#define _LCDDATA5_S17C1         0x02
#define _LCDDATA5_SEG18         0x04
#define _LCDDATA5_SEG18COM1     0x04
#define _LCDDATA5_S18C1         0x04
#define _LCDDATA5_SEG19         0x08
#define _LCDDATA5_SEG19COM1     0x08
#define _LCDDATA5_S19C1         0x08
#define _LCDDATA5_SEG20         0x10
#define _LCDDATA5_SEG20COM1     0x10
#define _LCDDATA5_S20C1         0x10
#define _LCDDATA5_SEG21         0x20
#define _LCDDATA5_SEG21COM1     0x20
#define _LCDDATA5_S21C1         0x20
#define _LCDDATA5_SEG22         0x40
#define _LCDDATA5_SEG22COM1     0x40
#define _LCDDATA5_S22C1         0x40
#define _LCDDATA5_SEG23         0x80
#define _LCDDATA5_SEG23COM1     0x80
#define _LCDDATA5_S23C1         0x80

//==============================================================================


//==============================================================================
//        LCDDATA6 Bits

extern __at(0x0116) __sfr LCDDATA6;

typedef union
  {
  struct
    {
    unsigned SEG0               : 1;
    unsigned SEG1               : 1;
    unsigned SEG2               : 1;
    unsigned SEG3               : 1;
    unsigned SEG4               : 1;
    unsigned SEG5               : 1;
    unsigned SEG6               : 1;
    unsigned SEG7               : 1;
    };

  struct
    {
    unsigned SEG0COM2           : 1;
    unsigned SEG1COM2           : 1;
    unsigned SEG2COM2           : 1;
    unsigned SEG3COM2           : 1;
    unsigned SEG4COM2           : 1;
    unsigned SEG5COM2           : 1;
    unsigned SEG6COM2           : 1;
    unsigned SEG7COM2           : 1;
    };

  struct
    {
    unsigned S0C2               : 1;
    unsigned S1C2               : 1;
    unsigned S2C2               : 1;
    unsigned S3C2               : 1;
    unsigned S4C2               : 1;
    unsigned S5C2               : 1;
    unsigned S6C2               : 1;
    unsigned S7C2               : 1;
    };
  } __LCDDATA6bits_t;

extern __at(0x0116) volatile __LCDDATA6bits_t LCDDATA6bits;

#define _LCDDATA6_SEG0          0x01
#define _LCDDATA6_SEG0COM2      0x01
#define _LCDDATA6_S0C2          0x01
#define _LCDDATA6_SEG1          0x02
#define _LCDDATA6_SEG1COM2      0x02
#define _LCDDATA6_S1C2          0x02
#define _LCDDATA6_SEG2          0x04
#define _LCDDATA6_SEG2COM2      0x04
#define _LCDDATA6_S2C2          0x04
#define _LCDDATA6_SEG3          0x08
#define _LCDDATA6_SEG3COM2      0x08
#define _LCDDATA6_S3C2          0x08
#define _LCDDATA6_SEG4          0x10
#define _LCDDATA6_SEG4COM2      0x10
#define _LCDDATA6_S4C2          0x10
#define _LCDDATA6_SEG5          0x20
#define _LCDDATA6_SEG5COM2      0x20
#define _LCDDATA6_S5C2          0x20
#define _LCDDATA6_SEG6          0x40
#define _LCDDATA6_SEG6COM2      0x40
#define _LCDDATA6_S6C2          0x40
#define _LCDDATA6_SEG7          0x80
#define _LCDDATA6_SEG7COM2      0x80
#define _LCDDATA6_S7C2          0x80

//==============================================================================


//==============================================================================
//        LCDDATA7 Bits

extern __at(0x0117) __sfr LCDDATA7;

typedef union
  {
  struct
    {
    unsigned SEG8               : 1;
    unsigned SEG9               : 1;
    unsigned SEG10              : 1;
    unsigned SEG11              : 1;
    unsigned SEG12              : 1;
    unsigned SEG13              : 1;
    unsigned SEG14              : 1;
    unsigned SEG15              : 1;
    };

  struct
    {
    unsigned SEG8COM2           : 1;
    unsigned SEG9COM2           : 1;
    unsigned SEG10COM2          : 1;
    unsigned SEG11COM2          : 1;
    unsigned SEG12COM2          : 1;
    unsigned SEG13COM2          : 1;
    unsigned SEG14COM2          : 1;
    unsigned SEG15COM2          : 1;
    };

  struct
    {
    unsigned S8C2               : 1;
    unsigned S9C2               : 1;
    unsigned S10C2              : 1;
    unsigned S11C2              : 1;
    unsigned S12C2              : 1;
    unsigned S13C2              : 1;
    unsigned S14C2              : 1;
    unsigned S15C2              : 1;
    };
  } __LCDDATA7bits_t;

extern __at(0x0117) volatile __LCDDATA7bits_t LCDDATA7bits;

#define _LCDDATA7_SEG8          0x01
#define _LCDDATA7_SEG8COM2      0x01
#define _LCDDATA7_S8C2          0x01
#define _LCDDATA7_SEG9          0x02
#define _LCDDATA7_SEG9COM2      0x02
#define _LCDDATA7_S9C2          0x02
#define _LCDDATA7_SEG10         0x04
#define _LCDDATA7_SEG10COM2     0x04
#define _LCDDATA7_S10C2         0x04
#define _LCDDATA7_SEG11         0x08
#define _LCDDATA7_SEG11COM2     0x08
#define _LCDDATA7_S11C2         0x08
#define _LCDDATA7_SEG12         0x10
#define _LCDDATA7_SEG12COM2     0x10
#define _LCDDATA7_S12C2         0x10
#define _LCDDATA7_SEG13         0x20
#define _LCDDATA7_SEG13COM2     0x20
#define _LCDDATA7_S13C2         0x20
#define _LCDDATA7_SEG14         0x40
#define _LCDDATA7_SEG14COM2     0x40
#define _LCDDATA7_S14C2         0x40
#define _LCDDATA7_SEG15         0x80
#define _LCDDATA7_SEG15COM2     0x80
#define _LCDDATA7_S15C2         0x80

//==============================================================================


//==============================================================================
//        LCDDATA8 Bits

extern __at(0x0118) __sfr LCDDATA8;

typedef union
  {
  struct
    {
    unsigned SEG16              : 1;
    unsigned SEG17              : 1;
    unsigned SEG18              : 1;
    unsigned SEG19              : 1;
    unsigned SEG20              : 1;
    unsigned SEG21              : 1;
    unsigned SEG22              : 1;
    unsigned SEG23              : 1;
    };

  struct
    {
    unsigned SEG16COM2          : 1;
    unsigned SEG17COM2          : 1;
    unsigned SEG18COM2          : 1;
    unsigned SEG19COM2          : 1;
    unsigned SEG20COM2          : 1;
    unsigned SEG21COM2          : 1;
    unsigned SEG22COM2          : 1;
    unsigned SEG23COM2          : 1;
    };

  struct
    {
    unsigned S16C2              : 1;
    unsigned S17C2              : 1;
    unsigned S18C2              : 1;
    unsigned S19C2              : 1;
    unsigned S20C2              : 1;
    unsigned S21C2              : 1;
    unsigned S22C2              : 1;
    unsigned S23C2              : 1;
    };
  } __LCDDATA8bits_t;

extern __at(0x0118) volatile __LCDDATA8bits_t LCDDATA8bits;

#define _LCDDATA8_SEG16         0x01
#define _LCDDATA8_SEG16COM2     0x01
#define _LCDDATA8_S16C2         0x01
#define _LCDDATA8_SEG17         0x02
#define _LCDDATA8_SEG17COM2     0x02
#define _LCDDATA8_S17C2         0x02
#define _LCDDATA8_SEG18         0x04
#define _LCDDATA8_SEG18COM2     0x04
#define _LCDDATA8_S18C2         0x04
#define _LCDDATA8_SEG19         0x08
#define _LCDDATA8_SEG19COM2     0x08
#define _LCDDATA8_S19C2         0x08
#define _LCDDATA8_SEG20         0x10
#define _LCDDATA8_SEG20COM2     0x10
#define _LCDDATA8_S20C2         0x10
#define _LCDDATA8_SEG21         0x20
#define _LCDDATA8_SEG21COM2     0x20
#define _LCDDATA8_S21C2         0x20
#define _LCDDATA8_SEG22         0x40
#define _LCDDATA8_SEG22COM2     0x40
#define _LCDDATA8_S22C2         0x40
#define _LCDDATA8_SEG23         0x80
#define _LCDDATA8_SEG23COM2     0x80
#define _LCDDATA8_S23C2         0x80

//==============================================================================


//==============================================================================
//        LCDDATA9 Bits

extern __at(0x0119) __sfr LCDDATA9;

typedef union
  {
  struct
    {
    unsigned SEG0               : 1;
    unsigned SEG1               : 1;
    unsigned SEG2               : 1;
    unsigned SEG3               : 1;
    unsigned SEG4               : 1;
    unsigned SEG5               : 1;
    unsigned SEG6               : 1;
    unsigned SEG7               : 1;
    };

  struct
    {
    unsigned SEG0COM3           : 1;
    unsigned SEG1COM3           : 1;
    unsigned SEG2COM3           : 1;
    unsigned SEG3COM3           : 1;
    unsigned SEG4COM3           : 1;
    unsigned SEG5COM3           : 1;
    unsigned SEG6COM3           : 1;
    unsigned SEG7COM3           : 1;
    };

  struct
    {
    unsigned S0C3               : 1;
    unsigned S1C3               : 1;
    unsigned S2C3               : 1;
    unsigned S3C3               : 1;
    unsigned S4C3               : 1;
    unsigned S5C3               : 1;
    unsigned S6C3               : 1;
    unsigned S7C3               : 1;
    };
  } __LCDDATA9bits_t;

extern __at(0x0119) volatile __LCDDATA9bits_t LCDDATA9bits;

#define _LCDDATA9_SEG0          0x01
#define _LCDDATA9_SEG0COM3      0x01
#define _LCDDATA9_S0C3          0x01
#define _LCDDATA9_SEG1          0x02
#define _LCDDATA9_SEG1COM3      0x02
#define _LCDDATA9_S1C3          0x02
#define _LCDDATA9_SEG2          0x04
#define _LCDDATA9_SEG2COM3      0x04
#define _LCDDATA9_S2C3          0x04
#define _LCDDATA9_SEG3          0x08
#define _LCDDATA9_SEG3COM3      0x08
#define _LCDDATA9_S3C3          0x08
#define _LCDDATA9_SEG4          0x10
#define _LCDDATA9_SEG4COM3      0x10
#define _LCDDATA9_S4C3          0x10
#define _LCDDATA9_SEG5          0x20
#define _LCDDATA9_SEG5COM3      0x20
#define _LCDDATA9_S5C3          0x20
#define _LCDDATA9_SEG6          0x40
#define _LCDDATA9_SEG6COM3      0x40
#define _LCDDATA9_S6C3          0x40
#define _LCDDATA9_SEG7          0x80
#define _LCDDATA9_SEG7COM3      0x80
#define _LCDDATA9_S7C3          0x80

//==============================================================================


//==============================================================================
//        LCDDATA10 Bits

extern __at(0x011A) __sfr LCDDATA10;

typedef union
  {
  struct
    {
    unsigned SEG8               : 1;
    unsigned SEG9               : 1;
    unsigned SEG10              : 1;
    unsigned SEG11              : 1;
    unsigned SEG12              : 1;
    unsigned SEG13              : 1;
    unsigned SEG14              : 1;
    unsigned SEG15              : 1;
    };

  struct
    {
    unsigned SEG8COM3           : 1;
    unsigned SEG9COM3           : 1;
    unsigned SEG10COM3          : 1;
    unsigned SEG11COM3          : 1;
    unsigned SEG12COM3          : 1;
    unsigned SEG13COM3          : 1;
    unsigned SEG14COM3          : 1;
    unsigned SEG15COM3          : 1;
    };

  struct
    {
    unsigned S8C3               : 1;
    unsigned S9C3               : 1;
    unsigned S10C3              : 1;
    unsigned S11C3              : 1;
    unsigned S12C3              : 1;
    unsigned S13C3              : 1;
    unsigned S14C3              : 1;
    unsigned S15C3              : 1;
    };
  } __LCDDATA10bits_t;

