OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f946.h
extern __at(0x0190) volatile __LCDDATA12bits_t LCDDATA12bits;

#define _SEG24                  0x01
#define _SEG24COM0              0x01
#define _S24C0                  0x01
#define _SEG25                  0x02
#define _SEG25COM0              0x02
#define _S25C0                  0x02
#define _SEG26                  0x04
#define _SEG26COM0              0x04
#define _S26C0                  0x04
#define _SEG27                  0x08
#define _SEG27COM0              0x08
#define _S27C0                  0x08
#define _SEG28                  0x10
#define _SEG28COM0              0x10
#define _S28C0                  0x10
#define _SEG29                  0x20
#define _SEG29COM0              0x20
#define _S29C0                  0x20
#define _SEG30                  0x40
#define _SEG30COM0              0x40
#define _S30C0                  0x40
#define _SEG31                  0x80
#define _SEG31COM0              0x80
#define _S31C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA13 Bits

extern __at(0x0191) __sfr LCDDATA13;

typedef union
  {
  struct
    {
    unsigned SEG32              : 1;
    unsigned SEG33              : 1;
    unsigned SEG34              : 1;
    unsigned SEG35              : 1;
    unsigned SEG36              : 1;
    unsigned SEG37              : 1;
    unsigned SEG38              : 1;
    unsigned SEG39              : 1;
    };

  struct
    {
    unsigned SEG32COM0          : 1;
    unsigned SEG33COM0          : 1;
    unsigned SEG34COM0          : 1;
    unsigned SEG35COM0          : 1;
    unsigned SEG36COM0          : 1;
    unsigned SEG37COM0          : 1;
    unsigned SEG38COM0          : 1;
    unsigned SEG39COM0          : 1;
    };

  struct
    {
    unsigned S32C0              : 1;
    unsigned S33C0              : 1;
    unsigned S34C0              : 1;
    unsigned S35C0              : 1;
    unsigned S36C0              : 1;
    unsigned S37C0              : 1;
    unsigned S38C0              : 1;
    unsigned S39C0              : 1;
    };
  } __LCDDATA13bits_t;

extern __at(0x0191) volatile __LCDDATA13bits_t LCDDATA13bits;

#define _SEG32                  0x01
#define _SEG32COM0              0x01
#define _S32C0                  0x01
#define _SEG33                  0x02
#define _SEG33COM0              0x02
#define _S33C0                  0x02
#define _SEG34                  0x04
#define _SEG34COM0              0x04
#define _S34C0                  0x04
#define _SEG35                  0x08
#define _SEG35COM0              0x08
#define _S35C0                  0x08
#define _SEG36                  0x10
#define _SEG36COM0              0x10
#define _S36C0                  0x10
#define _SEG37                  0x20
#define _SEG37COM0              0x20
#define _S37C0                  0x20
#define _SEG38                  0x40
#define _SEG38COM0              0x40
#define _S38C0                  0x40
#define _SEG39                  0x80
#define _SEG39COM0              0x80
#define _S39C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA14 Bits

extern __at(0x0192) __sfr LCDDATA14;

typedef union
  {
  struct
    {
    unsigned SEG40              : 1;
    unsigned SEG41              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SEG40COM0          : 1;
    unsigned SEG41COM0          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned S40C0              : 1;
    unsigned S41C0              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __LCDDATA14bits_t;

extern __at(0x0192) volatile __LCDDATA14bits_t LCDDATA14bits;

#define _SEG40                  0x01
#define _SEG40COM0              0x01
#define _S40C0                  0x01
#define _SEG41                  0x02
#define _SEG41COM0              0x02
#define _S41C0                  0x02

//==============================================================================


//==============================================================================
//        LCDDATA15 Bits

extern __at(0x0193) __sfr LCDDATA15;

typedef union
  {
  struct
    {
    unsigned SEG24              : 1;
    unsigned SEG25              : 1;
    unsigned SEG26              : 1;
    unsigned SEG27              : 1;
    unsigned SEG28              : 1;
    unsigned SEG29              : 1;
    unsigned SEG30              : 1;
    unsigned SEG31              : 1;
    };

  struct
    {
    unsigned SEG24COM1          : 1;
    unsigned SEG25COM1          : 1;
    unsigned SEG26COM1          : 1;
    unsigned SEG27COM1          : 1;
    unsigned SEG28COM1          : 1;
    unsigned SEG29COM1          : 1;
    unsigned SEG30COM1          : 1;
    unsigned SEG31COM1          : 1;
    };

  struct
    {
    unsigned S24C1              : 1;
    unsigned S25C1              : 1;
    unsigned S26C1              : 1;
    unsigned S27C1              : 1;
    unsigned S28C1              : 1;
    unsigned S29C1              : 1;
    unsigned S30C1              : 1;
    unsigned S31C1              : 1;
    };
  } __LCDDATA15bits_t;

extern __at(0x0193) volatile __LCDDATA15bits_t LCDDATA15bits;

#define _LCDDATA15_SEG24        0x01
#define _LCDDATA15_SEG24COM1    0x01
#define _LCDDATA15_S24C1        0x01
#define _LCDDATA15_SEG25        0x02
#define _LCDDATA15_SEG25COM1    0x02
#define _LCDDATA15_S25C1        0x02
#define _LCDDATA15_SEG26        0x04
#define _LCDDATA15_SEG26COM1    0x04
#define _LCDDATA15_S26C1        0x04
#define _LCDDATA15_SEG27        0x08
#define _LCDDATA15_SEG27COM1    0x08
#define _LCDDATA15_S27C1        0x08
#define _LCDDATA15_SEG28        0x10
#define _LCDDATA15_SEG28COM1    0x10
#define _LCDDATA15_S28C1        0x10
#define _LCDDATA15_SEG29        0x20
#define _LCDDATA15_SEG29COM1    0x20
#define _LCDDATA15_S29C1        0x20
#define _LCDDATA15_SEG30        0x40
#define _LCDDATA15_SEG30COM1    0x40
#define _LCDDATA15_S30C1        0x40
#define _LCDDATA15_SEG31        0x80
#define _LCDDATA15_SEG31COM1    0x80
#define _LCDDATA15_S31C1        0x80

//==============================================================================


//==============================================================================
//        LCDDATA16 Bits

extern __at(0x0194) __sfr LCDDATA16;

typedef union
  {
  struct
    {
    unsigned SEG32              : 1;
    unsigned SEG33              : 1;
    unsigned SEG34              : 1;
    unsigned SEG35              : 1;
    unsigned SEG36              : 1;
    unsigned SEG37              : 1;
    unsigned SEG38              : 1;
    unsigned SEG39              : 1;
    };

  struct
    {
    unsigned SEG32COM1          : 1;
    unsigned SEG33COM1          : 1;
    unsigned SEG34COM1          : 1;
    unsigned SEG35COM1          : 1;
    unsigned SEG36COM1          : 1;
    unsigned SEG37COM1          : 1;
    unsigned SEG38COM1          : 1;
    unsigned SEG39COM1          : 1;
    };

  struct
    {
    unsigned S32C1              : 1;
    unsigned S33C1              : 1;
    unsigned S34C1              : 1;
    unsigned S35C1              : 1;
    unsigned S36C1              : 1;
    unsigned S37C1              : 1;
    unsigned S38C1              : 1;
    unsigned S39C1              : 1;
    };
  } __LCDDATA16bits_t;

extern __at(0x0194) volatile __LCDDATA16bits_t LCDDATA16bits;

#define _LCDDATA16_SEG32        0x01
#define _LCDDATA16_SEG32COM1    0x01
#define _LCDDATA16_S32C1        0x01
#define _LCDDATA16_SEG33        0x02
#define _LCDDATA16_SEG33COM1    0x02
#define _LCDDATA16_S33C1        0x02
#define _LCDDATA16_SEG34        0x04
#define _LCDDATA16_SEG34COM1    0x04
#define _LCDDATA16_S34C1        0x04
#define _LCDDATA16_SEG35        0x08
#define _LCDDATA16_SEG35COM1    0x08
#define _LCDDATA16_S35C1        0x08
#define _LCDDATA16_SEG36        0x10
#define _LCDDATA16_SEG36COM1    0x10
#define _LCDDATA16_S36C1        0x10
#define _LCDDATA16_SEG37        0x20
#define _LCDDATA16_SEG37COM1    0x20
#define _LCDDATA16_S37C1        0x20
#define _LCDDATA16_SEG38        0x40
#define _LCDDATA16_SEG38COM1    0x40
#define _LCDDATA16_S38C1        0x40
#define _LCDDATA16_SEG39        0x80
#define _LCDDATA16_SEG39COM1    0x80
#define _LCDDATA16_S39C1        0x80

//==============================================================================


//==============================================================================
//        LCDDATA17 Bits

