OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f946.h
extern __at(0x0195) __sfr LCDDATA17;

typedef union
  {
  struct
    {
    unsigned SEG40              : 1;
    unsigned SEG41              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SEG40COM1          : 1;
    unsigned SEG41COM1          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned S40C1              : 1;
    unsigned S41C1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __LCDDATA17bits_t;

extern __at(0x0195) volatile __LCDDATA17bits_t LCDDATA17bits;

#define _LCDDATA17_SEG40        0x01
#define _LCDDATA17_SEG40COM1    0x01
#define _LCDDATA17_S40C1        0x01
#define _LCDDATA17_SEG41        0x02
#define _LCDDATA17_SEG41COM1    0x02
#define _LCDDATA17_S41C1        0x02

//==============================================================================


//==============================================================================
//        LCDDATA18 Bits

extern __at(0x0196) __sfr LCDDATA18;

typedef union
  {
  struct
    {
    unsigned SEG24              : 1;
    unsigned SEG25              : 1;
    unsigned SEG26              : 1;
    unsigned SEG27              : 1;
    unsigned SEG28              : 1;
    unsigned SEG29              : 1;
    unsigned SEG30              : 1;
    unsigned SEG31              : 1;
    };

  struct
    {
    unsigned SEG24COM2          : 1;
    unsigned SEG25COM2          : 1;
    unsigned SEG26COM2          : 1;
    unsigned SEG27COM2          : 1;
    unsigned SEG28COM2          : 1;
    unsigned SEG29COM2          : 1;
    unsigned SEG30COM2          : 1;
    unsigned SEG31COM2          : 1;
    };

  struct
    {
    unsigned S24C2              : 1;
    unsigned S25C2              : 1;
    unsigned S26C2              : 1;
    unsigned S27C2              : 1;
    unsigned S28C2              : 1;
    unsigned S29C2              : 1;
    unsigned S30C2              : 1;
    unsigned S31C2              : 1;
    };
  } __LCDDATA18bits_t;

extern __at(0x0196) volatile __LCDDATA18bits_t LCDDATA18bits;

#define _LCDDATA18_SEG24        0x01
#define _LCDDATA18_SEG24COM2    0x01
#define _LCDDATA18_S24C2        0x01
#define _LCDDATA18_SEG25        0x02
#define _LCDDATA18_SEG25COM2    0x02
#define _LCDDATA18_S25C2        0x02
#define _LCDDATA18_SEG26        0x04
#define _LCDDATA18_SEG26COM2    0x04
#define _LCDDATA18_S26C2        0x04
#define _LCDDATA18_SEG27        0x08
#define _LCDDATA18_SEG27COM2    0x08
#define _LCDDATA18_S27C2        0x08
#define _LCDDATA18_SEG28        0x10
#define _LCDDATA18_SEG28COM2    0x10
#define _LCDDATA18_S28C2        0x10
#define _LCDDATA18_SEG29        0x20
#define _LCDDATA18_SEG29COM2    0x20
#define _LCDDATA18_S29C2        0x20
#define _LCDDATA18_SEG30        0x40
#define _LCDDATA18_SEG30COM2    0x40
#define _LCDDATA18_S30C2        0x40
#define _LCDDATA18_SEG31        0x80
#define _LCDDATA18_SEG31COM2    0x80
#define _LCDDATA18_S31C2        0x80

//==============================================================================


//==============================================================================
//        LCDDATA19 Bits

extern __at(0x0197) __sfr LCDDATA19;

typedef union
  {
  struct
    {
    unsigned SEG32              : 1;
    unsigned SEG33              : 1;
    unsigned SEG34              : 1;
    unsigned SEG35              : 1;
    unsigned SEG36              : 1;
    unsigned SEG37              : 1;
    unsigned SEG38              : 1;
    unsigned SEG39              : 1;
    };

  struct
    {
    unsigned SEG32COM2          : 1;
    unsigned SEG33COM2          : 1;
    unsigned SEG34COM2          : 1;
    unsigned SEG35COM2          : 1;
    unsigned SEG36COM2          : 1;
    unsigned SEG37COM2          : 1;
    unsigned SEG38COM2          : 1;
    unsigned SEG39COM2          : 1;
    };

  struct
    {
    unsigned S32C2              : 1;
    unsigned S33C2              : 1;
    unsigned S34C2              : 1;
    unsigned S35C2              : 1;
    unsigned S36C2              : 1;
    unsigned S37C2              : 1;
    unsigned S38C2              : 1;
    unsigned S39C2              : 1;
    };
  } __LCDDATA19bits_t;

extern __at(0x0197) volatile __LCDDATA19bits_t LCDDATA19bits;

#define _LCDDATA19_SEG32        0x01
#define _LCDDATA19_SEG32COM2    0x01
#define _LCDDATA19_S32C2        0x01
#define _LCDDATA19_SEG33        0x02
#define _LCDDATA19_SEG33COM2    0x02
#define _LCDDATA19_S33C2        0x02
#define _LCDDATA19_SEG34        0x04
#define _LCDDATA19_SEG34COM2    0x04
#define _LCDDATA19_S34C2        0x04
#define _LCDDATA19_SEG35        0x08
#define _LCDDATA19_SEG35COM2    0x08
#define _LCDDATA19_S35C2        0x08
#define _LCDDATA19_SEG36        0x10
#define _LCDDATA19_SEG36COM2    0x10
#define _LCDDATA19_S36C2        0x10
#define _LCDDATA19_SEG37        0x20
#define _LCDDATA19_SEG37COM2    0x20
#define _LCDDATA19_S37C2        0x20
#define _LCDDATA19_SEG38        0x40
#define _LCDDATA19_SEG38COM2    0x40
#define _LCDDATA19_S38C2        0x40
#define _LCDDATA19_SEG39        0x80
#define _LCDDATA19_SEG39COM2    0x80
#define _LCDDATA19_S39C2        0x80

//==============================================================================


//==============================================================================
//        LCDDATA20 Bits

extern __at(0x0198) __sfr LCDDATA20;

typedef union
  {
  struct
    {
    unsigned SEG40              : 1;
    unsigned SEG41              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SEG40COM2          : 1;
    unsigned SEG41COM2          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned S40C2              : 1;
    unsigned S41C2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __LCDDATA20bits_t;

extern __at(0x0198) volatile __LCDDATA20bits_t LCDDATA20bits;

