OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f946.h
#define _LCDDATA20_SEG40        0x01
#define _LCDDATA20_SEG40COM2    0x01
#define _LCDDATA20_S40C2        0x01
#define _LCDDATA20_SEG41        0x02
#define _LCDDATA20_SEG41COM2    0x02
#define _LCDDATA20_S41C2        0x02

//==============================================================================


//==============================================================================
//        LCDDATA21 Bits

extern __at(0x0199) __sfr LCDDATA21;

typedef union
  {
  struct
    {
    unsigned SEG24              : 1;
    unsigned SEG25              : 1;
    unsigned SEG26              : 1;
    unsigned SEG27              : 1;
    unsigned SEG28              : 1;
    unsigned SEG29              : 1;
    unsigned SEG30              : 1;
    unsigned SEG31              : 1;
    };

  struct
    {
    unsigned SEG24COM3          : 1;
    unsigned SEG25COM3          : 1;
    unsigned SEG26COM3          : 1;
    unsigned SEG27COM3          : 1;
    unsigned SEG28COM3          : 1;
    unsigned SEG29COM3          : 1;
    unsigned SEG30COM3          : 1;
    unsigned SEG31COM3          : 1;
    };

  struct
    {
    unsigned S24C3              : 1;
    unsigned S25C3              : 1;
    unsigned S26C3              : 1;
    unsigned S27C3              : 1;
    unsigned S28C3              : 1;
    unsigned S29C3              : 1;
    unsigned S30C3              : 1;
    unsigned S31C3              : 1;
    };
  } __LCDDATA21bits_t;

extern __at(0x0199) volatile __LCDDATA21bits_t LCDDATA21bits;

#define _LCDDATA21_SEG24        0x01
#define _LCDDATA21_SEG24COM3    0x01
#define _LCDDATA21_S24C3        0x01
#define _LCDDATA21_SEG25        0x02
#define _LCDDATA21_SEG25COM3    0x02
#define _LCDDATA21_S25C3        0x02
#define _LCDDATA21_SEG26        0x04
#define _LCDDATA21_SEG26COM3    0x04
#define _LCDDATA21_S26C3        0x04
#define _LCDDATA21_SEG27        0x08
#define _LCDDATA21_SEG27COM3    0x08
#define _LCDDATA21_S27C3        0x08
#define _LCDDATA21_SEG28        0x10
#define _LCDDATA21_SEG28COM3    0x10
#define _LCDDATA21_S28C3        0x10
#define _LCDDATA21_SEG29        0x20
#define _LCDDATA21_SEG29COM3    0x20
#define _LCDDATA21_S29C3        0x20
#define _LCDDATA21_SEG30        0x40
#define _LCDDATA21_SEG30COM3    0x40
#define _LCDDATA21_S30C3        0x40
#define _LCDDATA21_SEG31        0x80
#define _LCDDATA21_SEG31COM3    0x80
#define _LCDDATA21_S31C3        0x80

//==============================================================================


//==============================================================================
//        LCDDATA22 Bits

extern __at(0x019A) __sfr LCDDATA22;

typedef union
  {
  struct
    {
    unsigned SEG32              : 1;
    unsigned SEG33              : 1;
    unsigned SEG34              : 1;
    unsigned SEG35              : 1;
    unsigned SEG36              : 1;
    unsigned SEG37              : 1;
    unsigned SEG38              : 1;
    unsigned SEG39              : 1;
    };

  struct
    {
    unsigned SEG32COM3          : 1;
    unsigned SEG33COM3          : 1;
    unsigned SEG34COM3          : 1;
    unsigned SEG35COM3          : 1;
    unsigned SEG36COM3          : 1;
    unsigned SEG37COM3          : 1;
    unsigned SEG38COM3          : 1;
    unsigned SEG39COM3          : 1;
    };

  struct
    {
    unsigned S32C3              : 1;
    unsigned S33C3              : 1;
    unsigned S34C3              : 1;
    unsigned S35C3              : 1;
    unsigned S36C3              : 1;
    unsigned S37C3              : 1;
    unsigned S38C3              : 1;
    unsigned S39C3              : 1;
    };
  } __LCDDATA22bits_t;

extern __at(0x019A) volatile __LCDDATA22bits_t LCDDATA22bits;

#define _LCDDATA22_SEG32        0x01
#define _LCDDATA22_SEG32COM3    0x01
#define _LCDDATA22_S32C3        0x01
#define _LCDDATA22_SEG33        0x02
#define _LCDDATA22_SEG33COM3    0x02
#define _LCDDATA22_S33C3        0x02
#define _LCDDATA22_SEG34        0x04
#define _LCDDATA22_SEG34COM3    0x04
#define _LCDDATA22_S34C3        0x04
#define _LCDDATA22_SEG35        0x08
#define _LCDDATA22_SEG35COM3    0x08
#define _LCDDATA22_S35C3        0x08
#define _LCDDATA22_SEG36        0x10
#define _LCDDATA22_SEG36COM3    0x10
#define _LCDDATA22_S36C3        0x10
#define _LCDDATA22_SEG37        0x20
#define _LCDDATA22_SEG37COM3    0x20
#define _LCDDATA22_S37C3        0x20
#define _LCDDATA22_SEG38        0x40
#define _LCDDATA22_SEG38COM3    0x40
#define _LCDDATA22_S38C3        0x40
#define _LCDDATA22_SEG39        0x80
#define _LCDDATA22_SEG39COM3    0x80
#define _LCDDATA22_S39C3        0x80

//==============================================================================


//==============================================================================
//        LCDDATA23 Bits

extern __at(0x019B) __sfr LCDDATA23;

typedef union
  {
  struct
    {
    unsigned SEG40              : 1;
    unsigned SEG41              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SEG40COM3          : 1;
    unsigned SEG41COM3          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned S40C3              : 1;
    unsigned S41C3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __LCDDATA23bits_t;

extern __at(0x019B) volatile __LCDDATA23bits_t LCDDATA23bits;

#define _LCDDATA23_SEG40        0x01
#define _LCDDATA23_SEG40COM3    0x01
#define _LCDDATA23_S40C3        0x01
#define _LCDDATA23_SEG41        0x02
#define _LCDDATA23_SEG41COM3    0x02
#define _LCDDATA23_S41C3        0x02

//==============================================================================


//==============================================================================
//        LCDSE3 Bits

extern __at(0x019C) __sfr LCDSE3;

typedef union
  {
  struct
    {
    unsigned SEG24              : 1;
    unsigned SEG25              : 1;
    unsigned SEG26              : 1;
    unsigned SEG27              : 1;
    unsigned SEG28              : 1;
    unsigned SEG29              : 1;
    unsigned SEG30              : 1;
    unsigned SEG31              : 1;
    };

  struct
    {
    unsigned SE24               : 1;
    unsigned SE25               : 1;
    unsigned SE26               : 1;
    unsigned SE27               : 1;
    unsigned SE28               : 1;
    unsigned SE29               : 1;
    unsigned SE30               : 1;
    unsigned SE31               : 1;
    };

  struct
    {
    unsigned SEGEN24            : 1;
    unsigned SEGEN25            : 1;
    unsigned SEGEN26            : 1;
    unsigned SEGEN27            : 1;
    unsigned SEGEN28            : 1;
    unsigned SEGEN29            : 1;
    unsigned SEGEN30            : 1;
    unsigned SEGEN31            : 1;
    };
  } __LCDSE3bits_t;

