OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f946.h
extern __at(0x019C) volatile __LCDSE3bits_t LCDSE3bits;

#define _LCDSE3_SEG24           0x01
#define _LCDSE3_SE24            0x01
#define _LCDSE3_SEGEN24         0x01
#define _LCDSE3_SEG25           0x02
#define _LCDSE3_SE25            0x02
#define _LCDSE3_SEGEN25         0x02
#define _LCDSE3_SEG26           0x04
#define _LCDSE3_SE26            0x04
#define _LCDSE3_SEGEN26         0x04
#define _LCDSE3_SEG27           0x08
#define _LCDSE3_SE27            0x08
#define _LCDSE3_SEGEN27         0x08
#define _LCDSE3_SEG28           0x10
#define _LCDSE3_SE28            0x10
#define _LCDSE3_SEGEN28         0x10
#define _LCDSE3_SEG29           0x20
#define _LCDSE3_SE29            0x20
#define _LCDSE3_SEGEN29         0x20
#define _LCDSE3_SEG30           0x40
#define _LCDSE3_SE30            0x40
#define _LCDSE3_SEGEN30         0x40
#define _LCDSE3_SEG31           0x80
#define _LCDSE3_SE31            0x80
#define _LCDSE3_SEGEN31         0x80

//==============================================================================


//==============================================================================
//        LCDSE4 Bits

extern __at(0x019D) __sfr LCDSE4;

typedef union
  {
  struct
    {
    unsigned SEG32              : 1;
    unsigned SEG33              : 1;
    unsigned SEG34              : 1;
    unsigned SEG35              : 1;
    unsigned SEG36              : 1;
    unsigned SEG37              : 1;
    unsigned SEG38              : 1;
    unsigned SEG39              : 1;
    };

  struct
    {
    unsigned SE32               : 1;
    unsigned SE33               : 1;
    unsigned SE34               : 1;
    unsigned SE35               : 1;
    unsigned SE36               : 1;
    unsigned SE37               : 1;
    unsigned SE38               : 1;
    unsigned SE39               : 1;
    };

  struct
    {
    unsigned SEGEN32            : 1;
    unsigned SEGEN33            : 1;
    unsigned SEGEN34            : 1;
    unsigned SEGEN35            : 1;
    unsigned SEGEN36            : 1;
    unsigned SEGEN37            : 1;
    unsigned SEGEN38            : 1;
    unsigned SEGEN39            : 1;
    };
  } __LCDSE4bits_t;

extern __at(0x019D) volatile __LCDSE4bits_t LCDSE4bits;

#define _LCDSE4_SEG32           0x01
#define _LCDSE4_SE32            0x01
#define _LCDSE4_SEGEN32         0x01
#define _LCDSE4_SEG33           0x02
#define _LCDSE4_SE33            0x02
#define _LCDSE4_SEGEN33         0x02
#define _LCDSE4_SEG34           0x04
#define _LCDSE4_SE34            0x04
#define _LCDSE4_SEGEN34         0x04
#define _LCDSE4_SEG35           0x08
#define _LCDSE4_SE35            0x08
#define _LCDSE4_SEGEN35         0x08
#define _LCDSE4_SEG36           0x10
#define _LCDSE4_SE36            0x10
#define _LCDSE4_SEGEN36         0x10
#define _LCDSE4_SEG37           0x20
#define _LCDSE4_SE37            0x20
#define _LCDSE4_SEGEN37         0x20
#define _LCDSE4_SEG38           0x40
#define _LCDSE4_SE38            0x40
#define _LCDSE4_SEGEN38         0x40
#define _LCDSE4_SEG39           0x80
#define _LCDSE4_SE39            0x80
#define _LCDSE4_SEGEN39         0x80

//==============================================================================


//==============================================================================
//        LCDSE5 Bits

extern __at(0x019E) __sfr LCDSE5;

typedef union
  {
  struct
    {
    unsigned SEG40              : 1;
    unsigned SEG41              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SE40               : 1;
    unsigned SE41               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SEGEN40            : 1;
    unsigned SEGEN41            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __LCDSE5bits_t;

extern __at(0x019E) volatile __LCDSE5bits_t LCDSE5bits;

#define _LCDSE5_SEG40           0x01
#define _LCDSE5_SE40            0x01
#define _LCDSE5_SEGEN40         0x01
#define _LCDSE5_SEG41           0x02
#define _LCDSE5_SE41            0x02
#define _LCDSE5_SEGEN41         0x02

//==============================================================================


//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG                 0x2007

//----------------------------- CONFIG Options -------------------------------

#define _FOSC_LP                0x3FF8  // LP oscillator: Low-power crystal on RA6/OSC2/CLKOUT/T1OSO and RA7/OSC1/CLKIN/T1OSI.
#define _LP_OSC                 0x3FF8  // LP oscillator: Low-power crystal on RA6/OSC2/CLKOUT/T1OSO and RA7/OSC1/CLKIN/T1OSI.
#define _FOSC_XT                0x3FF9  // XT oscillator: Crystal/resonator on RA6/OSC2/CLKOUT/T1OSO and RA7/OSC1/CLKIN/T1OSI.
#define _XT_OSC                 0x3FF9  // XT oscillator: Crystal/resonator on RA6/OSC2/CLKOUT/T1OSO and RA7/OSC1/CLKIN/T1OSI.
#define _FOSC_HS                0x3FFA  // HS oscillator: High-speed crystal/resonator on RA6/OSC2/CLKOUT/T1OSO and RA7/OSC1/CLKIN/T1OSI.
#define _HS_OSC                 0x3FFA  // HS oscillator: High-speed crystal/resonator on RA6/OSC2/CLKOUT/T1OSO and RA7/OSC1/CLKIN/T1OSI.
#define _FOSC_EC                0x3FFB  // EC: I/O function on RA6/OSC2/CLKOUT/T1OSO pin, CLKIN on RA7/OSC1/CLKIN/T1OSI.
#define _EC_OSC                 0x3FFB  // EC: I/O function on RA6/OSC2/CLKOUT/T1OSO pin, CLKIN on RA7/OSC1/CLKIN/T1OSI.
#define _FOSC_INTOSCIO          0x3FFC  // INTOSCIO oscillator: I/O function on RA6/OSC2/CLKOUT/T1OSO pin, I/O function on RA7/OSC1/CLKIN/T1OSI.
#define _INTRC_OSC_NOCLKOUT     0x3FFC  // INTOSCIO oscillator: I/O function on RA6/OSC2/CLKOUT/T1OSO pin, I/O function on RA7/OSC1/CLKIN/T1OSI.
#define _INTOSCIO               0x3FFC  // INTOSCIO oscillator: I/O function on RA6/OSC2/CLKOUT/T1OSO pin, I/O function on RA7/OSC1/CLKIN/T1OSI.
#define _FOSC_INTOSCCLK         0x3FFD  // INTOSC oscillator: CLKOUT function on RA6/OSC2/CLKOUT/T1OSO pin, I/O function on RA7/OSC1/CLKIN/T1OSI.
#define _INTRC_OSC_CLKOUT       0x3FFD  // INTOSC oscillator: CLKOUT function on RA6/OSC2/CLKOUT/T1OSO pin, I/O function on RA7/OSC1/CLKIN/T1OSI.
#define _INTOSC                 0x3FFD  // INTOSC oscillator: CLKOUT function on RA6/OSC2/CLKOUT/T1OSO pin, I/O function on RA7/OSC1/CLKIN/T1OSI.
#define _FOSC_EXTRCIO           0x3FFE  // RCIO oscillator: I/O function on RA6/OSC2/CLKOUT/T1OSO pin, RC on RA7/OSC1/CLKIN/T1OSI.
#define _EXTRC_OSC_NOCLKOUT     0x3FFE  // RCIO oscillator: I/O function on RA6/OSC2/CLKOUT/T1OSO pin, RC on RA7/OSC1/CLKIN/T1OSI.
#define _EXTRCIO                0x3FFE  // RCIO oscillator: I/O function on RA6/OSC2/CLKOUT/T1OSO pin, RC on RA7/OSC1/CLKIN/T1OSI.
#define _FOSC_EXTRCCLK          0x3FFF  // RC oscillator: CLKOUT function on RA6/OSC2/CLKOUT/T1OSO pin, RC on RA7/OSC1/CLKIN/T1OSI.
#define _EXTRC_OSC_CLKOUT       0x3FFF  // RC oscillator: CLKOUT function on RA6/OSC2/CLKOUT/T1OSO pin, RC on RA7/OSC1/CLKIN/T1OSI.
#define _EXTRC                  0x3FFF  // RC oscillator: CLKOUT function on RA6/OSC2/CLKOUT/T1OSO pin, RC on RA7/OSC1/CLKIN/T1OSI.
#define _WDTE_OFF               0x3FF7  // WDT disabled and can be enabled by SWDTEN bit of the WDTCON register.
#define _WDT_OFF                0x3FF7  // WDT disabled and can be enabled by SWDTEN bit of the WDTCON register.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FEF  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _MCLRE_OFF              0x3FDF  // RE3/MCLR pin function is digital input, MCLR internally tied to VDD.
#define _MCLRE_ON               0x3FFF  // RE3/MCLR pin function is MCLR.
#define _CP_ON                  0x3FBF  // Program memory code protection is enabled.
#define _CP_OFF                 0x3FFF  // Program memory code protection is disabled.
#define _CPD_ON                 0x3F7F  // Data memory code protection is enabled.
#define _CPD_OFF                0x3FFF  // Data memory code protection is disabled.
#define _BOREN_OFF              0x3CFF  // BOR disabled.
#define _BOD_OFF                0x3CFF  // BOR disabled.
#define _BOREN_SBODEN           0x3DFF  // BOR controlled by SBOREN bit of the PCON register.
#define _BOD_SBODEN             0x3DFF  // BOR controlled by SBOREN bit of the PCON register.
#define _BOREN_NSLEEP           0x3EFF  // BOR enabled during operation and disabled in Sleep.
#define _BOD_NSLEEP             0x3EFF  // BOR enabled during operation and disabled in Sleep.
#define _BOREN_ON               0x3FFF  // BOR enabled.
#define _BOD_ON                 0x3FFF  // BOR enabled.
#define _IESO_OFF               0x3BFF  // Internal/External Switchover mode is disabled.
#define _IESO_ON                0x3FFF  // Internal/External Switchover mode is enabled.
#define _FCMEN_OFF              0x37FF  // Fail-Safe Clock Monitor is disabled.
#define _FCMEN_ON               0x3FFF  // Fail-Safe Clock Monitor is enabled.
#define _DEBUG_ON               0x2FFF  // In-Circuit Debugger enabled, RB6/ICSPCLK and RB7/ICSPDAT are dedicated to the debugger.
#define _DEBUG_OFF              0x3FFF  // In-Circuit Debugger disabled, RB6/ISCPCLK and RB7/ICSPDAT are general purpose I/O pins.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

