OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f946.h
#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 1, shadows bit in ADCON0bits
#define NOT_DONE                ADCON0bits.NOT_DONE             // bit 1, shadows bit in ADCON0bits
#define GO_DONE                 ADCON0bits.GO_DONE              // bit 1, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 1, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 2
#define CHS1                    ADCON0bits.CHS1                 // bit 3
#define CHS2                    ADCON0bits.CHS2                 // bit 4
#define VCFG0                   ADCON0bits.VCFG0                // bit 5
#define VCFG1                   ADCON0bits.VCFG1                // bit 6
#define ADFM                    ADCON0bits.ADFM                 // bit 7

#define ADCS0                   ADCON1bits.ADCS0                // bit 4
#define ADCS1                   ADCON1bits.ADCS1                // bit 5
#define ADCS2                   ADCON1bits.ADCS2                // bit 6

#define ANS0                    ANSELbits.ANS0                  // bit 0, shadows bit in ANSELbits
#define AN0                     ANSELbits.AN0                   // bit 0, shadows bit in ANSELbits
#define ANS1                    ANSELbits.ANS1                  // bit 1, shadows bit in ANSELbits
#define AN1                     ANSELbits.AN1                   // bit 1, shadows bit in ANSELbits
#define ANS2                    ANSELbits.ANS2                  // bit 2, shadows bit in ANSELbits
#define AN2                     ANSELbits.AN2                   // bit 2, shadows bit in ANSELbits
#define ANS3                    ANSELbits.ANS3                  // bit 3, shadows bit in ANSELbits
#define AN3                     ANSELbits.AN3                   // bit 3, shadows bit in ANSELbits
#define ANS4                    ANSELbits.ANS4                  // bit 4, shadows bit in ANSELbits
#define AN4                     ANSELbits.AN4                   // bit 4, shadows bit in ANSELbits
#define ANS5                    ANSELbits.ANS5                  // bit 5, shadows bit in ANSELbits
#define AN5                     ANSELbits.AN5                   // bit 5, shadows bit in ANSELbits
#define ANS6                    ANSELbits.ANS6                  // bit 6, shadows bit in ANSELbits
#define AN6                     ANSELbits.AN6                   // bit 6, shadows bit in ANSELbits
#define ANS7                    ANSELbits.ANS7                  // bit 7, shadows bit in ANSELbits
#define AN7                     ANSELbits.AN7                   // bit 7, shadows bit in ANSELbits

#define CCP1M0                  CCP1CONbits.CCP1M0              // bit 0
#define CCP1M1                  CCP1CONbits.CCP1M1              // bit 1
#define CCP1M2                  CCP1CONbits.CCP1M2              // bit 2
#define CCP1M3                  CCP1CONbits.CCP1M3              // bit 3
#define CCP1Y                   CCP1CONbits.CCP1Y               // bit 4
#define CCP1X                   CCP1CONbits.CCP1X               // bit 5

#define CCP2M0                  CCP2CONbits.CCP2M0              // bit 0
#define CCP2M1                  CCP2CONbits.CCP2M1              // bit 1
#define CCP2M2                  CCP2CONbits.CCP2M2              // bit 2
#define CCP2M3                  CCP2CONbits.CCP2M3              // bit 3
#define CCP2Y                   CCP2CONbits.CCP2Y               // bit 4
#define CCP2X                   CCP2CONbits.CCP2X               // bit 5

#define CM0                     CMCON0bits.CM0                  // bit 0
#define CM1                     CMCON0bits.CM1                  // bit 1
#define CM2                     CMCON0bits.CM2                  // bit 2
#define CIS                     CMCON0bits.CIS                  // bit 3
#define C1INV                   CMCON0bits.C1INV                // bit 4
#define C2INV                   CMCON0bits.C2INV                // bit 5
#define C1OUT                   CMCON0bits.C1OUT                // bit 6
#define C2OUT                   CMCON0bits.C2OUT                // bit 7

#define C2SYNC                  CMCON1bits.C2SYNC               // bit 0
#define T1GSS                   CMCON1bits.T1GSS                // bit 1

#define EEADRL0                 EEADRbits.EEADRL0               // bit 0
#define EEADRL1                 EEADRbits.EEADRL1               // bit 1
#define EEADRL2                 EEADRbits.EEADRL2               // bit 2
#define EEADRL3                 EEADRbits.EEADRL3               // bit 3
#define EEADRL4                 EEADRbits.EEADRL4               // bit 4
#define EEADRL5                 EEADRbits.EEADRL5               // bit 5
#define EEADRL6                 EEADRbits.EEADRL6               // bit 6
#define EEADRL7                 EEADRbits.EEADRL7               // bit 7

#define EEADRH0                 EEADRHbits.EEADRH0              // bit 0
#define EEADRH1                 EEADRHbits.EEADRH1              // bit 1
#define EEADRH2                 EEADRHbits.EEADRH2              // bit 2
#define EEADRH3                 EEADRHbits.EEADRH3              // bit 3
#define EEADRH4                 EEADRHbits.EEADRH4              // bit 4

#define RD                      EECON1bits.RD                   // bit 0, shadows bit in EECON1bits
#define EERD                    EECON1bits.EERD                 // bit 0, shadows bit in EECON1bits
#define WR                      EECON1bits.WR                   // bit 1, shadows bit in EECON1bits
#define EEWR                    EECON1bits.EEWR                 // bit 1, shadows bit in EECON1bits
#define WREN                    EECON1bits.WREN                 // bit 2
#define WRERR                   EECON1bits.WRERR                // bit 3
#define EEPGD                   EECON1bits.EEPGD                // bit 7

#define EEDATL0                 EEDATAbits.EEDATL0              // bit 0
#define EEDATL1                 EEDATAbits.EEDATL1              // bit 1
#define EEDATL2                 EEDATAbits.EEDATL2              // bit 2
#define EEDATL3                 EEDATAbits.EEDATL3              // bit 3
#define EEDATL4                 EEDATAbits.EEDATL4              // bit 4
#define EEDATL5                 EEDATAbits.EEDATL5              // bit 5
#define EEDATL6                 EEDATAbits.EEDATL6              // bit 6
#define EEDATL7                 EEDATAbits.EEDATL7              // bit 7

#define EEDATH0                 EEDATHbits.EEDATH0              // bit 0
#define EEDATH1                 EEDATHbits.EEDATH1              // bit 1
#define EEDATH2                 EEDATHbits.EEDATH2              // bit 2
#define EEDATH3                 EEDATHbits.EEDATH3              // bit 3
#define EEDATH4                 EEDATHbits.EEDATH4              // bit 4
#define EEDATH5                 EEDATHbits.EEDATH5              // bit 5

#define RBIF                    INTCONbits.RBIF                 // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define TMR0IF                  INTCONbits.TMR0IF               // bit 2, shadows bit in INTCONbits
#define T0IF                    INTCONbits.T0IF                 // bit 2, shadows bit in INTCONbits
#define RBIE                    INTCONbits.RBIE                 // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define TMR0IE                  INTCONbits.TMR0IE               // bit 5, shadows bit in INTCONbits
#define T0IE                    INTCONbits.T0IE                 // bit 5, shadows bit in INTCONbits
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define IOCB4                   IOCbits.IOCB4                   // bit 4, shadows bit in IOCbits
#define IOC4                    IOCbits.IOC4                    // bit 4, shadows bit in IOCbits
#define IOCB5                   IOCbits.IOCB5                   // bit 5, shadows bit in IOCbits
#define IOC5                    IOCbits.IOC5                    // bit 5, shadows bit in IOCbits
#define IOCB6                   IOCbits.IOCB6                   // bit 6, shadows bit in IOCbits
#define IOC6                    IOCbits.IOC6                    // bit 6, shadows bit in IOCbits
#define IOCB7                   IOCbits.IOCB7                   // bit 7, shadows bit in IOCbits
#define IOC7                    IOCbits.IOC7                    // bit 7, shadows bit in IOCbits

