OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f946.h
#define LMUX0                   LCDCONbits.LMUX0                // bit 0
#define LMUX1                   LCDCONbits.LMUX1                // bit 1
#define CS0                     LCDCONbits.CS0                  // bit 2
#define CS1                     LCDCONbits.CS1                  // bit 3
#define VLCDEN                  LCDCONbits.VLCDEN               // bit 4
#define WERR                    LCDCONbits.WERR                 // bit 5
#define SLPEN                   LCDCONbits.SLPEN                // bit 6
#define LCDEN                   LCDCONbits.LCDEN                // bit 7

#define SEG0                    LCDDATA0bits.SEG0               // bit 0, shadows bit in LCDDATA0bits
#define SEG0COM0                LCDDATA0bits.SEG0COM0           // bit 0, shadows bit in LCDDATA0bits
#define S0C0                    LCDDATA0bits.S0C0               // bit 0, shadows bit in LCDDATA0bits
#define SEG1                    LCDDATA0bits.SEG1               // bit 1, shadows bit in LCDDATA0bits
#define SEG1COM0                LCDDATA0bits.SEG1COM0           // bit 1, shadows bit in LCDDATA0bits
#define S1C0                    LCDDATA0bits.S1C0               // bit 1, shadows bit in LCDDATA0bits
#define SEG2                    LCDDATA0bits.SEG2               // bit 2, shadows bit in LCDDATA0bits
#define SEG2COM0                LCDDATA0bits.SEG2COM0           // bit 2, shadows bit in LCDDATA0bits
#define S2C0                    LCDDATA0bits.S2C0               // bit 2, shadows bit in LCDDATA0bits
#define SEG3                    LCDDATA0bits.SEG3               // bit 3, shadows bit in LCDDATA0bits
#define SEG3COM0                LCDDATA0bits.SEG3COM0           // bit 3, shadows bit in LCDDATA0bits
#define S3C0                    LCDDATA0bits.S3C0               // bit 3, shadows bit in LCDDATA0bits
#define SEG4                    LCDDATA0bits.SEG4               // bit 4, shadows bit in LCDDATA0bits
#define SEG4COM0                LCDDATA0bits.SEG4COM0           // bit 4, shadows bit in LCDDATA0bits
#define S4C0                    LCDDATA0bits.S4C0               // bit 4, shadows bit in LCDDATA0bits
#define SEG5                    LCDDATA0bits.SEG5               // bit 5, shadows bit in LCDDATA0bits
#define SEG5COM0                LCDDATA0bits.SEG5COM0           // bit 5, shadows bit in LCDDATA0bits
#define S5C0                    LCDDATA0bits.S5C0               // bit 5, shadows bit in LCDDATA0bits
#define SEG6                    LCDDATA0bits.SEG6               // bit 6, shadows bit in LCDDATA0bits
#define SEG6COM0                LCDDATA0bits.SEG6COM0           // bit 6, shadows bit in LCDDATA0bits
#define S6C0                    LCDDATA0bits.S6C0               // bit 6, shadows bit in LCDDATA0bits
#define SEG7                    LCDDATA0bits.SEG7               // bit 7, shadows bit in LCDDATA0bits
#define SEG7COM0                LCDDATA0bits.SEG7COM0           // bit 7, shadows bit in LCDDATA0bits
#define S7C0                    LCDDATA0bits.S7C0               // bit 7, shadows bit in LCDDATA0bits

#define SEG8                    LCDDATA1bits.SEG8               // bit 0, shadows bit in LCDDATA1bits
#define SEG8COM0                LCDDATA1bits.SEG8COM0           // bit 0, shadows bit in LCDDATA1bits
#define S8C0                    LCDDATA1bits.S8C0               // bit 0, shadows bit in LCDDATA1bits
#define SEG9                    LCDDATA1bits.SEG9               // bit 1, shadows bit in LCDDATA1bits
#define SEG9COM0                LCDDATA1bits.SEG9COM0           // bit 1, shadows bit in LCDDATA1bits
#define S9C0                    LCDDATA1bits.S9C0               // bit 1, shadows bit in LCDDATA1bits
#define SEG10                   LCDDATA1bits.SEG10              // bit 2, shadows bit in LCDDATA1bits
#define SEG10COM0               LCDDATA1bits.SEG10COM0          // bit 2, shadows bit in LCDDATA1bits
#define S10C0                   LCDDATA1bits.S10C0              // bit 2, shadows bit in LCDDATA1bits
#define SEG11                   LCDDATA1bits.SEG11              // bit 3, shadows bit in LCDDATA1bits
#define SEG11COM0               LCDDATA1bits.SEG11COM0          // bit 3, shadows bit in LCDDATA1bits
#define S11C0                   LCDDATA1bits.S11C0              // bit 3, shadows bit in LCDDATA1bits
#define SEG12                   LCDDATA1bits.SEG12              // bit 4, shadows bit in LCDDATA1bits
#define SEG12COM0               LCDDATA1bits.SEG12COM0          // bit 4, shadows bit in LCDDATA1bits
#define S12C0                   LCDDATA1bits.S12C0              // bit 4, shadows bit in LCDDATA1bits
#define SEG13                   LCDDATA1bits.SEG13              // bit 5, shadows bit in LCDDATA1bits
#define SEG13COM0               LCDDATA1bits.SEG13COM0          // bit 5, shadows bit in LCDDATA1bits
#define S13C0                   LCDDATA1bits.S13C0              // bit 5, shadows bit in LCDDATA1bits
#define SEG14                   LCDDATA1bits.SEG14              // bit 6, shadows bit in LCDDATA1bits
#define SEG14COM0               LCDDATA1bits.SEG14COM0          // bit 6, shadows bit in LCDDATA1bits
#define S14C0                   LCDDATA1bits.S14C0              // bit 6, shadows bit in LCDDATA1bits
#define SEG15                   LCDDATA1bits.SEG15              // bit 7, shadows bit in LCDDATA1bits
#define SEG15COM0               LCDDATA1bits.SEG15COM0          // bit 7, shadows bit in LCDDATA1bits
#define S15C0                   LCDDATA1bits.S15C0              // bit 7, shadows bit in LCDDATA1bits

#define SEG16                   LCDDATA2bits.SEG16              // bit 0, shadows bit in LCDDATA2bits
#define SEG16COM0               LCDDATA2bits.SEG16COM0          // bit 0, shadows bit in LCDDATA2bits
#define S16C0                   LCDDATA2bits.S16C0              // bit 0, shadows bit in LCDDATA2bits
#define SEG17                   LCDDATA2bits.SEG17              // bit 1, shadows bit in LCDDATA2bits
#define SEG17COM0               LCDDATA2bits.SEG17COM0          // bit 1, shadows bit in LCDDATA2bits
#define S17C0                   LCDDATA2bits.S17C0              // bit 1, shadows bit in LCDDATA2bits
#define SEG18                   LCDDATA2bits.SEG18              // bit 2, shadows bit in LCDDATA2bits
#define SEG18COM0               LCDDATA2bits.SEG18COM0          // bit 2, shadows bit in LCDDATA2bits
#define S18C0                   LCDDATA2bits.S18C0              // bit 2, shadows bit in LCDDATA2bits
#define SEG19                   LCDDATA2bits.SEG19              // bit 3, shadows bit in LCDDATA2bits
#define SEG19COM0               LCDDATA2bits.SEG19COM0          // bit 3, shadows bit in LCDDATA2bits
#define S19C0                   LCDDATA2bits.S19C0              // bit 3, shadows bit in LCDDATA2bits
#define SEG20                   LCDDATA2bits.SEG20              // bit 4, shadows bit in LCDDATA2bits
#define SEG20COM0               LCDDATA2bits.SEG20COM0          // bit 4, shadows bit in LCDDATA2bits
#define S20C0                   LCDDATA2bits.S20C0              // bit 4, shadows bit in LCDDATA2bits
#define SEG21                   LCDDATA2bits.SEG21              // bit 5, shadows bit in LCDDATA2bits
#define SEG21COM0               LCDDATA2bits.SEG21COM0          // bit 5, shadows bit in LCDDATA2bits
#define S21C0                   LCDDATA2bits.S21C0              // bit 5, shadows bit in LCDDATA2bits
#define SEG22                   LCDDATA2bits.SEG22              // bit 6, shadows bit in LCDDATA2bits
#define SEG22COM0               LCDDATA2bits.SEG22COM0          // bit 6, shadows bit in LCDDATA2bits
#define S22C0                   LCDDATA2bits.S22C0              // bit 6, shadows bit in LCDDATA2bits
#define SEG23                   LCDDATA2bits.SEG23              // bit 7, shadows bit in LCDDATA2bits
#define SEG23COM0               LCDDATA2bits.SEG23COM0          // bit 7, shadows bit in LCDDATA2bits
#define S23C0                   LCDDATA2bits.S23C0              // bit 7, shadows bit in LCDDATA2bits

#define SEG24                   LCDDATA12bits.SEG24             // bit 0, shadows bit in LCDDATA12bits
#define SEG24COM0               LCDDATA12bits.SEG24COM0         // bit 0, shadows bit in LCDDATA12bits
#define S24C0                   LCDDATA12bits.S24C0             // bit 0, shadows bit in LCDDATA12bits
#define SEG25                   LCDDATA12bits.SEG25             // bit 1, shadows bit in LCDDATA12bits
#define SEG25COM0               LCDDATA12bits.SEG25COM0         // bit 1, shadows bit in LCDDATA12bits
#define S25C0                   LCDDATA12bits.S25C0             // bit 1, shadows bit in LCDDATA12bits
#define SEG26                   LCDDATA12bits.SEG26             // bit 2, shadows bit in LCDDATA12bits
#define SEG26COM0               LCDDATA12bits.SEG26COM0         // bit 2, shadows bit in LCDDATA12bits
#define S26C0                   LCDDATA12bits.S26C0             // bit 2, shadows bit in LCDDATA12bits
#define SEG27                   LCDDATA12bits.SEG27             // bit 3, shadows bit in LCDDATA12bits
#define SEG27COM0               LCDDATA12bits.SEG27COM0         // bit 3, shadows bit in LCDDATA12bits
#define S27C0                   LCDDATA12bits.S27C0             // bit 3, shadows bit in LCDDATA12bits
#define SEG28                   LCDDATA12bits.SEG28             // bit 4, shadows bit in LCDDATA12bits
#define SEG28COM0               LCDDATA12bits.SEG28COM0         // bit 4, shadows bit in LCDDATA12bits
#define S28C0                   LCDDATA12bits.S28C0             // bit 4, shadows bit in LCDDATA12bits
#define SEG29                   LCDDATA12bits.SEG29             // bit 5, shadows bit in LCDDATA12bits
#define SEG29COM0               LCDDATA12bits.SEG29COM0         // bit 5, shadows bit in LCDDATA12bits
#define S29C0                   LCDDATA12bits.S29C0             // bit 5, shadows bit in LCDDATA12bits
#define SEG30                   LCDDATA12bits.SEG30             // bit 6, shadows bit in LCDDATA12bits
#define SEG30COM0               LCDDATA12bits.SEG30COM0         // bit 6, shadows bit in LCDDATA12bits
#define S30C0                   LCDDATA12bits.S30C0             // bit 6, shadows bit in LCDDATA12bits
#define SEG31                   LCDDATA12bits.SEG31             // bit 7, shadows bit in LCDDATA12bits
#define SEG31COM0               LCDDATA12bits.SEG31COM0         // bit 7, shadows bit in LCDDATA12bits
#define S31C0                   LCDDATA12bits.S31C0             // bit 7, shadows bit in LCDDATA12bits

