OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f946.h
#define SEG32                   LCDDATA13bits.SEG32             // bit 0, shadows bit in LCDDATA13bits
#define SEG32COM0               LCDDATA13bits.SEG32COM0         // bit 0, shadows bit in LCDDATA13bits
#define S32C0                   LCDDATA13bits.S32C0             // bit 0, shadows bit in LCDDATA13bits
#define SEG33                   LCDDATA13bits.SEG33             // bit 1, shadows bit in LCDDATA13bits
#define SEG33COM0               LCDDATA13bits.SEG33COM0         // bit 1, shadows bit in LCDDATA13bits
#define S33C0                   LCDDATA13bits.S33C0             // bit 1, shadows bit in LCDDATA13bits
#define SEG34                   LCDDATA13bits.SEG34             // bit 2, shadows bit in LCDDATA13bits
#define SEG34COM0               LCDDATA13bits.SEG34COM0         // bit 2, shadows bit in LCDDATA13bits
#define S34C0                   LCDDATA13bits.S34C0             // bit 2, shadows bit in LCDDATA13bits
#define SEG35                   LCDDATA13bits.SEG35             // bit 3, shadows bit in LCDDATA13bits
#define SEG35COM0               LCDDATA13bits.SEG35COM0         // bit 3, shadows bit in LCDDATA13bits
#define S35C0                   LCDDATA13bits.S35C0             // bit 3, shadows bit in LCDDATA13bits
#define SEG36                   LCDDATA13bits.SEG36             // bit 4, shadows bit in LCDDATA13bits
#define SEG36COM0               LCDDATA13bits.SEG36COM0         // bit 4, shadows bit in LCDDATA13bits
#define S36C0                   LCDDATA13bits.S36C0             // bit 4, shadows bit in LCDDATA13bits
#define SEG37                   LCDDATA13bits.SEG37             // bit 5, shadows bit in LCDDATA13bits
#define SEG37COM0               LCDDATA13bits.SEG37COM0         // bit 5, shadows bit in LCDDATA13bits
#define S37C0                   LCDDATA13bits.S37C0             // bit 5, shadows bit in LCDDATA13bits
#define SEG38                   LCDDATA13bits.SEG38             // bit 6, shadows bit in LCDDATA13bits
#define SEG38COM0               LCDDATA13bits.SEG38COM0         // bit 6, shadows bit in LCDDATA13bits
#define S38C0                   LCDDATA13bits.S38C0             // bit 6, shadows bit in LCDDATA13bits
#define SEG39                   LCDDATA13bits.SEG39             // bit 7, shadows bit in LCDDATA13bits
#define SEG39COM0               LCDDATA13bits.SEG39COM0         // bit 7, shadows bit in LCDDATA13bits
#define S39C0                   LCDDATA13bits.S39C0             // bit 7, shadows bit in LCDDATA13bits

#define SEG40                   LCDDATA14bits.SEG40             // bit 0, shadows bit in LCDDATA14bits
#define SEG40COM0               LCDDATA14bits.SEG40COM0         // bit 0, shadows bit in LCDDATA14bits
#define S40C0                   LCDDATA14bits.S40C0             // bit 0, shadows bit in LCDDATA14bits
#define SEG41                   LCDDATA14bits.SEG41             // bit 1, shadows bit in LCDDATA14bits
#define SEG41COM0               LCDDATA14bits.SEG41COM0         // bit 1, shadows bit in LCDDATA14bits
#define S41C0                   LCDDATA14bits.S41C0             // bit 1, shadows bit in LCDDATA14bits

#define LP0                     LCDPSbits.LP0                   // bit 0
#define LP1                     LCDPSbits.LP1                   // bit 1
#define LP2                     LCDPSbits.LP2                   // bit 2
#define LP3                     LCDPSbits.LP3                   // bit 3
#define WA                      LCDPSbits.WA                    // bit 4
#define LCDA                    LCDPSbits.LCDA                  // bit 5
#define BIASMD                  LCDPSbits.BIASMD                // bit 6
#define WFT                     LCDPSbits.WFT                   // bit 7

#define LVDL0                   LVDCONbits.LVDL0                // bit 0
#define LVDL1                   LVDCONbits.LVDL1                // bit 1
#define LVDL2                   LVDCONbits.LVDL2                // bit 2
#define LVDEN                   LVDCONbits.LVDEN                // bit 4
#define IRVST                   LVDCONbits.IRVST                // bit 5

#define PS0                     OPTION_REGbits.PS0              // bit 0
#define PS1                     OPTION_REGbits.PS1              // bit 1
#define PS2                     OPTION_REGbits.PS2              // bit 2
#define PSA                     OPTION_REGbits.PSA              // bit 3
#define T0SE                    OPTION_REGbits.T0SE             // bit 4
#define T0CS                    OPTION_REGbits.T0CS             // bit 5
#define INTEDG                  OPTION_REGbits.INTEDG           // bit 6
#define NOT_RBPU                OPTION_REGbits.NOT_RBPU         // bit 7

#define SCS                     OSCCONbits.SCS                  // bit 0
#define LTS                     OSCCONbits.LTS                  // bit 1
#define HTS                     OSCCONbits.HTS                  // bit 2
#define OSTS                    OSCCONbits.OSTS                 // bit 3
#define IRCF0                   OSCCONbits.IRCF0                // bit 4
#define IRCF1                   OSCCONbits.IRCF1                // bit 5
#define IRCF2                   OSCCONbits.IRCF2                // bit 6

#define TUN0                    OSCTUNEbits.TUN0                // bit 0
#define TUN1                    OSCTUNEbits.TUN1                // bit 1
#define TUN2                    OSCTUNEbits.TUN2                // bit 2
#define TUN3                    OSCTUNEbits.TUN3                // bit 3
#define TUN4                    OSCTUNEbits.TUN4                // bit 4

#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0, shadows bit in PCONbits
#define NOT_BO                  PCONbits.NOT_BO                 // bit 0, shadows bit in PCONbits
#define NOT_POR                 PCONbits.NOT_POR                // bit 1
#define SBOREN                  PCONbits.SBOREN                 // bit 4

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define TMR2IE                  PIE1bits.TMR2IE                 // bit 1
#define CCP1IE                  PIE1bits.CCP1IE                 // bit 2
#define SSPIE                   PIE1bits.SSPIE                  // bit 3
#define TXIE                    PIE1bits.TXIE                   // bit 4
#define RCIE                    PIE1bits.RCIE                   // bit 5
#define ADIE                    PIE1bits.ADIE                   // bit 6
#define EEIE                    PIE1bits.EEIE                   // bit 7

#define CCP2IE                  PIE2bits.CCP2IE                 // bit 0
#define LVDIE                   PIE2bits.LVDIE                  // bit 2
#define LCDIE                   PIE2bits.LCDIE                  // bit 4
#define C1IE                    PIE2bits.C1IE                   // bit 5
#define C2IE                    PIE2bits.C2IE                   // bit 6
#define OSFIE                   PIE2bits.OSFIE                  // bit 7

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0
#define TMR2IF                  PIR1bits.TMR2IF                 // bit 1
#define CCP1IF                  PIR1bits.CCP1IF                 // bit 2
#define SSPIF                   PIR1bits.SSPIF                  // bit 3
#define TXIF                    PIR1bits.TXIF                   // bit 4
#define RCIF                    PIR1bits.RCIF                   // bit 5
#define ADIF                    PIR1bits.ADIF                   // bit 6
#define EEIF                    PIR1bits.EEIF                   // bit 7

